docs/rfcs/001-versioned-modules.org
#+TITLE: RFC001: Support versioning of modules
#+AUTHOR: Simon Johnston
#+EMAIL: johnstonskj@gmail.com
#+LANGUAGE: en
#+OPTIONS: toc:1
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="./rfcs.css"/>
#+HTML_LINK_HOME: ./index.html
#+HTML_LINK_UP: ./index.html

* Introduction

TBD

*Document Status History*

| Date         | Status   | Comment               | Grammar Version |
|--------------+----------+-----------------------+-----------------|
| [2023-12-07] | Draft    |                       | =0.2.6=           |

* Motivation

#+BEGIN_SRC sdml :exports code :noeval
module provider is end
#+END_SRC

#+BEGIN_SRC sdml :exports code :noeval
module consumer is
  import provider
end
#+END_SRC

#+BEGIN_SRC sdml :exports code :noeval
module provider_v3 is end
#+END_SRC

#+BEGIN_SRC sdml :exports code :noeval
module consumer is
  import [
    provider
    provider_v3
  ]
end
#+END_SRC

** Constructing an Ontology

*** Without a base

#+BEGIN_SRC sdml :exports code :noeval
module provider is end
#+END_SRC

#+BEGIN_SRC ttl :exports code :noeval
@base <file:///users/me/sdml/modules/provider#> .
@prefix : <file:///users/me/sdml/modules/provider#> .
@prefix owl: <http://www.w3.org/2002/07/owl#> .
@prefix rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> .
@prefix sdml: <https://sdml.io/sdml-owl.ttl#> .

:   rdf:type owl:Ontology, sdml:Module ;
    rdfs:label "provider" .
#+END_SRC

