docs/rfcs/001-versioned-modules.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-12-21 Thu 10:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>RFC001: Support versioning of modules</title>
<meta name="author" content="Simon Johnston" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./rfcs.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="./index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">RFC001: Support versioning of modules
<br />
<span class="subtitle">Status: Draft</span>
</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org14a9140">Introduction</a></li>
<li><a href="#orgbf494ff">Motivation</a></li>
<li><a href="#org81d92bd">Alternatives Considered</a></li>
<li><a href="#orgb35c241">Proposed Change</a></li>
</ul>
</div>
</div>

<div id="outline-container-org14a9140" class="outline-2">
<h2 id="org14a9140">Introduction</h2>
<div class="outline-text-2" id="text-org14a9140">
<p>
TBD
</p>

<p>
<b>Document Status History</b>
</p>

<table border="0" cellspacing="0" cellpadding="6" rules="none" frame="none">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Date</th>
<th scope="col" class="org-left">Status</th>
<th scope="col" class="org-left">Comment</th>
<th scope="col" class="org-left">Grammar Version</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2023-12-07 Thu]</span></span></td>
<td class="org-left">Draft</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>0.2.6</code></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgbf494ff" class="outline-2">
<h2 id="orgbf494ff">Motivation</h2>
<div class="outline-text-2" id="text-orgbf494ff">
<div class="org-src-container">
<pre class="src src-sdml"><span style="color: #859900;">module</span> <span style="color: #268bd2;">provider</span> <span style="color: #859900;">is</span> <span style="color: #859900;">end</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sdml"><span style="color: #859900;">module</span> <span style="color: #268bd2;">consumer</span> <span style="color: #859900;">is</span>
  <span style="color: #859900;">import</span> <span style="color: #268bd2;">provider</span>
<span style="color: #859900;">end</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sdml"><span style="color: #859900;">module</span> <span style="color: #268bd2;">provider_v3</span> <span style="color: #859900;">is</span> <span style="color: #859900;">end</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sdml"><span style="color: #859900;">module</span> <span style="color: #268bd2;">consumer</span> <span style="color: #859900;">is</span>
  <span style="color: #859900;">import</span> <span style="color: #657b83; background-color: #fdf6e3;">[</span>
    <span style="color: #268bd2;">provider</span>
    <span style="color: #268bd2;">provider_v3</span>
  <span style="color: #657b83; background-color: #fdf6e3;">]</span>
<span style="color: #859900;">end</span>
</pre>
</div>
</div>

<div id="outline-container-org25a9510" class="outline-3">
<h3 id="org25a9510">Constructing an Ontology</h3>
<div class="outline-text-3" id="text-org25a9510">
</div>
<div id="outline-container-orgf6dea3f" class="outline-4">
<h4 id="orgf6dea3f">Without a base</h4>
<div class="outline-text-4" id="text-orgf6dea3f">
<div class="org-src-container">
<pre class="src src-sdml"><span style="color: #859900;">module</span> <span style="color: #268bd2;">provider</span> <span style="color: #859900;">is</span> <span style="color: #859900;">end</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ttl"><span style="color: #d33682;">@base</span> <span style="color: #b58900;"><a href="file:///users/me/sdml/modules/provider#&gt; .
@prefix : &lt;file:///users/me/sdml/modules/provider#&gt; .
@prefix owl: &lt;http://www.w3.org/2002/07/owl#&gt; .
@prefix rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt; .
@prefix sdml: &lt;https://sdml.io/sdml-owl.ttl#">&lt;file:///users/me/sdml/modules/provider#&gt;</a></span><span style="color: #93a1a1; font-style: italic;"><a href="file:///users/me/sdml/modules/provider#&gt; .
@prefix : &lt;file:///users/me/sdml/modules/provider#&gt; .
@prefix owl: &lt;http://www.w3.org/2002/07/owl#&gt; .
@prefix rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt; .
@prefix sdml: &lt;https://sdml.io/sdml-owl.ttl#"> .</a></span><a href="file:///users/me/sdml/modules/provider#&gt; .
@prefix : &lt;file:///users/me/sdml/modules/provider#&gt; .
@prefix owl: &lt;http://www.w3.org/2002/07/owl#&gt; .
@prefix rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt; .
@prefix sdml: &lt;https://sdml.io/sdml-owl.ttl#">
</a><span style="color: #d33682;"><a href="file:///users/me/sdml/modules/provider#&gt; .
@prefix : &lt;file:///users/me/sdml/modules/provider#&gt; .
@prefix owl: &lt;http://www.w3.org/2002/07/owl#&gt; .
@prefix rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt; .
@prefix sdml: &lt;https://sdml.io/sdml-owl.ttl#">@prefix</a></span><a href="file:///users/me/sdml/modules/provider#&gt; .
@prefix : &lt;file:///users/me/sdml/modules/provider#&gt; .
@prefix owl: &lt;http://www.w3.org/2002/07/owl#&gt; .
@prefix rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt; .
@prefix sdml: &lt;https://sdml.io/sdml-owl.ttl#"> </a><span style="color: #268bd2;"><a href="file:///users/me/sdml/modules/provider#&gt; .
@prefix : &lt;file:///users/me/sdml/modules/provider#&gt; .
@prefix owl: &lt;http://www.w3.org/2002/07/owl#&gt; .
@prefix rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt; .
@prefix sdml: &lt;https://sdml.io/sdml-owl.ttl#">:</a></span><a href="file:///users/me/sdml/modules/provider#&gt; .
@prefix : &lt;file:///users/me/sdml/modules/provider#&gt; .
@prefix owl: &lt;http://www.w3.org/2002/07/owl#&gt; .
@prefix rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt; .
@prefix sdml: &lt;https://sdml.io/sdml-owl.ttl#"> </a><span style="color: #b58900;"><a href="file:///users/me/sdml/modules/provider#&gt; .
@prefix : &lt;file:///users/me/sdml/modules/provider#&gt; .
@prefix owl: &lt;http://www.w3.org/2002/07/owl#&gt; .
@prefix rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt; .
@prefix sdml: &lt;https://sdml.io/sdml-owl.ttl#">&lt;file:///users/me/sdml/modules/provider#&gt;</a></span><span style="color: #93a1a1; font-style: italic;"><a href="file:///users/me/sdml/modules/provider#&gt; .
@prefix : &lt;file:///users/me/sdml/modules/provider#&gt; .
@prefix owl: &lt;http://www.w3.org/2002/07/owl#&gt; .
@prefix rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt; .
@prefix sdml: &lt;https://sdml.io/sdml-owl.ttl#"> .</a></span><a href="file:///users/me/sdml/modules/provider#&gt; .
@prefix : &lt;file:///users/me/sdml/modules/provider#&gt; .
@prefix owl: &lt;http://www.w3.org/2002/07/owl#&gt; .
@prefix rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt; .
@prefix sdml: &lt;https://sdml.io/sdml-owl.ttl#">
</a><span style="color: #d33682;"><a href="file:///users/me/sdml/modules/provider#&gt; .
@prefix : &lt;file:///users/me/sdml/modules/provider#&gt; .
@prefix owl: &lt;http://www.w3.org/2002/07/owl#&gt; .
@prefix rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt; .
@prefix sdml: &lt;https://sdml.io/sdml-owl.ttl#">@prefix</a></span><a href="file:///users/me/sdml/modules/provider#&gt; .
@prefix : &lt;file:///users/me/sdml/modules/provider#&gt; .
@prefix owl: &lt;http://www.w3.org/2002/07/owl#&gt; .
@prefix rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt; .
@prefix sdml: &lt;https://sdml.io/sdml-owl.ttl#"> </a><span style="color: #268bd2;"><a href="file:///users/me/sdml/modules/provider#&gt; .
@prefix : &lt;file:///users/me/sdml/modules/provider#&gt; .
@prefix owl: &lt;http://www.w3.org/2002/07/owl#&gt; .
@prefix rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt; .
@prefix sdml: &lt;https://sdml.io/sdml-owl.ttl#">owl:</a></span><a href="file:///users/me/sdml/modules/provider#&gt; .
@prefix : &lt;file:///users/me/sdml/modules/provider#&gt; .
@prefix owl: &lt;http://www.w3.org/2002/07/owl#&gt; .
@prefix rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt; .
@prefix sdml: &lt;https://sdml.io/sdml-owl.ttl#"> </a><span style="color: #b58900;"><a href="file:///users/me/sdml/modules/provider#&gt; .
@prefix : &lt;file:///users/me/sdml/modules/provider#&gt; .
@prefix owl: &lt;http://www.w3.org/2002/07/owl#&gt; .
@prefix rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt; .
@prefix sdml: &lt;https://sdml.io/sdml-owl.ttl#">&lt;http://www.w3.org/2002/07/owl#&gt;</a></span><span style="color: #93a1a1; font-style: italic;"><a href="file:///users/me/sdml/modules/provider#&gt; .
@prefix : &lt;file:///users/me/sdml/modules/provider#&gt; .
@prefix owl: &lt;http://www.w3.org/2002/07/owl#&gt; .
@prefix rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt; .
@prefix sdml: &lt;https://sdml.io/sdml-owl.ttl#"> .</a></span><a href="file:///users/me/sdml/modules/provider#&gt; .
@prefix : &lt;file:///users/me/sdml/modules/provider#&gt; .
@prefix owl: &lt;http://www.w3.org/2002/07/owl#&gt; .
@prefix rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt; .
@prefix sdml: &lt;https://sdml.io/sdml-owl.ttl#">
</a><span style="color: #d33682;"><a href="file:///users/me/sdml/modules/provider#&gt; .
@prefix : &lt;file:///users/me/sdml/modules/provider#&gt; .
@prefix owl: &lt;http://www.w3.org/2002/07/owl#&gt; .
@prefix rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt; .
@prefix sdml: &lt;https://sdml.io/sdml-owl.ttl#">@prefix</a></span><a href="file:///users/me/sdml/modules/provider#&gt; .
@prefix : &lt;file:///users/me/sdml/modules/provider#&gt; .
@prefix owl: &lt;http://www.w3.org/2002/07/owl#&gt; .
@prefix rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt; .
@prefix sdml: &lt;https://sdml.io/sdml-owl.ttl#"> </a><span style="color: #268bd2;"><a href="file:///users/me/sdml/modules/provider#&gt; .
@prefix : &lt;file:///users/me/sdml/modules/provider#&gt; .
@prefix owl: &lt;http://www.w3.org/2002/07/owl#&gt; .
@prefix rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt; .
@prefix sdml: &lt;https://sdml.io/sdml-owl.ttl#">rdf:</a></span><a href="file:///users/me/sdml/modules/provider#&gt; .
@prefix : &lt;file:///users/me/sdml/modules/provider#&gt; .
@prefix owl: &lt;http://www.w3.org/2002/07/owl#&gt; .
@prefix rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt; .
@prefix sdml: &lt;https://sdml.io/sdml-owl.ttl#"> </a><span style="color: #b58900;"><a href="file:///users/me/sdml/modules/provider#&gt; .
@prefix : &lt;file:///users/me/sdml/modules/provider#&gt; .
@prefix owl: &lt;http://www.w3.org/2002/07/owl#&gt; .
@prefix rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt; .
@prefix sdml: &lt;https://sdml.io/sdml-owl.ttl#">&lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt;</a></span><span style="color: #93a1a1; font-style: italic;"><a href="file:///users/me/sdml/modules/provider#&gt; .
@prefix : &lt;file:///users/me/sdml/modules/provider#&gt; .
@prefix owl: &lt;http://www.w3.org/2002/07/owl#&gt; .
@prefix rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt; .
@prefix sdml: &lt;https://sdml.io/sdml-owl.ttl#"> .</a></span><a href="file:///users/me/sdml/modules/provider#&gt; .
@prefix : &lt;file:///users/me/sdml/modules/provider#&gt; .
@prefix owl: &lt;http://www.w3.org/2002/07/owl#&gt; .
@prefix rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt; .
@prefix sdml: &lt;https://sdml.io/sdml-owl.ttl#">
</a><span style="color: #d33682;"><a href="file:///users/me/sdml/modules/provider#&gt; .
@prefix : &lt;file:///users/me/sdml/modules/provider#&gt; .
@prefix owl: &lt;http://www.w3.org/2002/07/owl#&gt; .
@prefix rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt; .
@prefix sdml: &lt;https://sdml.io/sdml-owl.ttl#">@prefix</a></span><a href="file:///users/me/sdml/modules/provider#&gt; .
@prefix : &lt;file:///users/me/sdml/modules/provider#&gt; .
@prefix owl: &lt;http://www.w3.org/2002/07/owl#&gt; .
@prefix rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt; .
@prefix sdml: &lt;https://sdml.io/sdml-owl.ttl#"> </a><span style="color: #268bd2;"><a href="file:///users/me/sdml/modules/provider#&gt; .
@prefix : &lt;file:///users/me/sdml/modules/provider#&gt; .
@prefix owl: &lt;http://www.w3.org/2002/07/owl#&gt; .
@prefix rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt; .
@prefix sdml: &lt;https://sdml.io/sdml-owl.ttl#">sdml:</a></span><a href="file:///users/me/sdml/modules/provider#&gt; .
@prefix : &lt;file:///users/me/sdml/modules/provider#&gt; .
@prefix owl: &lt;http://www.w3.org/2002/07/owl#&gt; .
@prefix rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt; .
@prefix sdml: &lt;https://sdml.io/sdml-owl.ttl#"> </a><span style="color: #b58900;"><a href="file:///users/me/sdml/modules/provider#&gt; .
@prefix : &lt;file:///users/me/sdml/modules/provider#&gt; .
@prefix owl: &lt;http://www.w3.org/2002/07/owl#&gt; .
@prefix rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt; .
@prefix sdml: &lt;https://sdml.io/sdml-owl.ttl#">&lt;https://sdml.io/sdml-owl.ttl#&gt;</a></span><span style="color: #93a1a1; font-style: italic;"> .</span>

:   <span style="color: #268bd2;">rdf:</span><span style="color: #268bd2;">type</span> <span style="color: #268bd2;">owl:</span><span style="color: #268bd2;">Ontology</span><span style="color: #859900;">,</span> <span style="color: #268bd2;">sdml:</span><span style="color: #268bd2;">Module</span> <span style="color: #859900;">;</span>
    <span style="color: #268bd2;">rdfs:</span><span style="color: #268bd2;">label</span> <span style="color: #2aa198;">"provider"</span> <span style="color: #859900;">.</span>
</pre>
</div>
</div>
</div>
