docs/rfcs/001-versioned-modules.org
* Alternatives Considered

** Using version identifiers

#+BEGIN_SRC sdml :exports code :noeval
module provider
  base <https://example.org/projects/provider#>
  version "0.3.2"
is
end
#+END_SRC

#+BEGIN_SRC sdml :exports code :noeval
module consumer is
  import provider "0.3.2"
end
#+END_SRC

** Using version identifiers and resolver

#+BEGIN_SRC json :exports code :noeval
{
  "base": "https://example.org/projects/",
  "entries": {
    "provider": {
      "item": {
        "relative_uri": "provider#",
        "relative_path": "src/provider.sdm"
      },
      "item": {
        "relative_uri": "provider#",
        "version": "0.3.2",
        "relative_path": "src/provider-v3.sdm"
      }
    }
  }
}
#+END_SRC

** Using version IRIs

#+BEGIN_SRC sdml :exports code :noeval
module provider
  base <https://example.org/projects/provider#>
  version <https://example.org/projects/v3/provider#>
is
end
#+END_SRC

#+BEGIN_SRC sdml :exports code :noeval
module consumer is
  import provider <https://example.org/projects/v3/provider#>
end
#+END_SRC

* Proposed Change

TBD

** Surface Syntax

#+BEGIN_SRC sdml :exports code :noeval
module provider
  <https://example.org/projects/provider#>
  version <https://example.org/projects/v3/provider#>
is
end
#+END_SRC

#+BEGIN_SRC sdml :exports code :noeval
module consumer is
  import provider <https://example.org/projects/v3/provider#>
end
#+END_SRC

** Grammar

From

#+BEGIN_SRC ebnf :exports code :noeval
Module
    ::= "module" Identifier ModuleBase? ModuleBody

ModuleBase
    ::= "base" Iri

ModuleBody
    ::= "is"
        ImportStatement* Annotation* Definition*
        "end"

ImportStatement
    ::= "import" ( Import | "[" Import+ "]" )

Import
    ::= MemberImport | ModuleImport

ModuleImport
    ::= Identifer
#+END_SRC

To

#+BEGIN_SRC ebnf :exports code :noeval
Module
    ::= "module" Identifier ModuleIri? ModuleBody

ModuleIri
    ::= Iri ( "version" Iri )?

ModuleImport
    ::= Identifer ( "=" Iri )?
#+END_SRC

** Resolver File

#+BEGIN_SRC json :exports code :noeval
{
  "uri": "https://example.org/projects/",
  "entries": {
    "provider": {
      "item": {
        "relative_uri": "provider#",
        "relative_path": "src/provider.sdm"
      },
      "item": {
        "relative_uri": "v3/provider#",
        "relative_path": "src/provider-v3.sdm"
      }
    }
  }
}
#+END_SRC
