docs/rfcs/001-versioned-modules.html

<div id="outline-container-org81d92bd" class="outline-2">
<h2 id="org81d92bd">Alternatives Considered</h2>
<div class="outline-text-2" id="text-org81d92bd">
</div>
<div id="outline-container-orgedc3cd0" class="outline-3">
<h3 id="orgedc3cd0">Using version identifiers</h3>
<div class="outline-text-3" id="text-orgedc3cd0">
<div class="org-src-container">
<pre class="src src-sdml"><span style="color: #859900;">module</span> <span style="color: #268bd2;">provider</span>
  <span style="color: #859900;">base</span> <span style="color: #2aa198; font-weight: bold;"><a href="https://example.org/projects/provider#">&lt;https://example.org/projects/provider#&gt;</a></span>
  version "0.3.2"
<span style="color: #859900;">is</span>
<span style="color: #859900;">end</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sdml"><span style="color: #859900;">module</span> <span style="color: #268bd2;">consumer</span> <span style="color: #859900;">is</span>
  <span style="color: #859900;">import</span> <span style="color: #268bd2;">provider</span> "0.3.2"
<span style="color: #859900;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbe382f9" class="outline-3">
<h3 id="orgbe382f9">Using version identifiers and resolver</h3>
<div class="outline-text-3" id="text-orgbe382f9">
<div class="org-src-container">
<pre class="src src-json"><span style="color: #657b83;">{</span>
  <span style="color: #6c71c4;">"base"</span>: <span style="color: #2aa198;">"https://example.org/projects/"</span>,
  <span style="color: #6c71c4;">"entries"</span>: <span style="color: #2aa198;">{</span>
    <span style="color: #6c71c4;">"provider"</span>: <span style="color: #b58900;">{</span>
      <span style="color: #6c71c4;">"item"</span>: <span style="color: #859900;">{</span>
        <span style="color: #6c71c4;">"relative_uri"</span>: <span style="color: #2aa198;">"provider#"</span>,
        <span style="color: #6c71c4;">"relative_path"</span>: <span style="color: #2aa198;">"src/provider.sdm"</span>
      <span style="color: #859900;">}</span>,
      <span style="color: #6c71c4;">"item"</span>: <span style="color: #859900;">{</span>
        <span style="color: #6c71c4;">"relative_uri"</span>: <span style="color: #2aa198;">"provider#"</span>,
        <span style="color: #6c71c4;">"version"</span>: <span style="color: #2aa198;">"0.3.2"</span>,
        <span style="color: #6c71c4;">"relative_path"</span>: <span style="color: #2aa198;">"src/provider-v3.sdm"</span>
      <span style="color: #859900;">}</span>
    <span style="color: #b58900;">}</span>
  <span style="color: #2aa198;">}</span>
<span style="color: #657b83;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8c812fe" class="outline-3">
<h3 id="org8c812fe">Using version IRIs</h3>
<div class="outline-text-3" id="text-org8c812fe">
<div class="org-src-container">
<pre class="src src-sdml"><span style="color: #859900;">module</span> <span style="color: #268bd2;">provider</span>
  <span style="color: #859900;">base</span> <span style="color: #2aa198; font-weight: bold;"><a href="https://example.org/projects/provider#&gt;
  version &lt;https://example.org/projects/v3/provider#">&lt;https://example.org/projects/provider#&gt;</a></span><a href="https://example.org/projects/provider#&gt;
  version &lt;https://example.org/projects/v3/provider#">
  version &lt;https://example.org/projects/v3/provider#&gt;</a>
<span style="color: #859900;">is</span>
<span style="color: #859900;">end</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sdml"><span style="color: #859900;">module</span> <span style="color: #268bd2;">consumer</span> <span style="color: #859900;">is</span>
  <span style="color: #859900;">import</span> <span style="color: #268bd2;">provider <a href="https://example.org/projects/v3/provider#">&lt;https://example</a></span><a href="https://example.org/projects/v3/provider#">.org/projects/v3/provider#&gt;</a>
<span style="color: #859900;">end</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb35c241" class="outline-2">
<h2 id="orgb35c241">Proposed Change</h2>
<div class="outline-text-2" id="text-orgb35c241">
<p>
TBD
</p>
</div>

<div id="outline-container-org8b2b77f" class="outline-3">
<h3 id="org8b2b77f">Surface Syntax</h3>
<div class="outline-text-3" id="text-org8b2b77f">
<div class="org-src-container">
<pre class="src src-sdml"><span style="color: #859900;">module</span> <span style="color: #268bd2;">provider</span>
  <a href="https://example.org/projects/provider#&gt;
  version &lt;https://example.org/projects/v3/provider#">&lt;https://example.org/projects/provider#&gt;
  version &lt;https://example.org/projects/v3/provider#&gt;</a>
<span style="color: #859900;">is</span>
<span style="color: #859900;">end</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sdml"><span style="color: #859900;">module</span> <span style="color: #268bd2;">consumer</span> <span style="color: #859900;">is</span>
  <span style="color: #859900;">import</span> <span style="color: #268bd2;">provider <a href="https://example.org/projects/v3/provider#">&lt;https://example</a></span><a href="https://example.org/projects/v3/provider#">.org/projects/v3/provider#&gt;</a>
<span style="color: #859900;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc578f6f" class="outline-3">
<h3 id="orgc578f6f">Grammar</h3>
<div class="outline-text-3" id="text-orgc578f6f">
<p>
From
</p>

<div class="org-src-container">
<pre class="src src-ebnf">Module
    ::= <span style="color: #2aa198;">"module"</span> Identifier ModuleBase? ModuleBody

ModuleBase
    ::= <span style="color: #2aa198;">"base"</span> Iri

ModuleBody
    ::= <span style="color: #2aa198;">"is"</span>
        ImportStatement* Annotation* Definition*
        <span style="color: #2aa198;">"end"</span>

ImportStatement
    ::= <span style="color: #2aa198;">"import"</span> <span style="color: #657b83;">(</span> Import | <span style="color: #2aa198;">"["</span> Import+ <span style="color: #2aa198;">"]"</span> <span style="color: #657b83;">)</span>

Import
    ::= MemberImport | ModuleImport

ModuleImport
    ::= Identifer
</pre>
</div>

<p>
To
</p>

<div class="org-src-container">
<pre class="src src-ebnf">Module
    ::= <span style="color: #2aa198;">"module"</span> Identifier ModuleIri? ModuleBody

ModuleIri
    ::= Iri <span style="color: #657b83;">(</span> <span style="color: #2aa198;">"version"</span> Iri <span style="color: #657b83;">)</span>?

ModuleImport
    ::= Identifer <span style="color: #657b83;">(</span> <span style="color: #2aa198;">"="</span> Iri <span style="color: #657b83;">)</span>?
</pre>
</div>
</div>
</div>

<div id="outline-container-org83b1b92" class="outline-3">
<h3 id="org83b1b92">Resolver File</h3>
<div class="outline-text-3" id="text-org83b1b92">
<div class="org-src-container">
<pre class="src src-json"><span style="color: #657b83;">{</span>
  <span style="color: #6c71c4;">"uri"</span>: <span style="color: #2aa198;">"https://example.org/projects/"</span>,
  <span style="color: #6c71c4;">"entries"</span>: <span style="color: #2aa198;">{</span>
    <span style="color: #6c71c4;">"provider"</span>: <span style="color: #b58900;">{</span>
      <span style="color: #6c71c4;">"item"</span>: <span style="color: #859900;">{</span>
        <span style="color: #6c71c4;">"relative_uri"</span>: <span style="color: #2aa198;">"provider#"</span>,
        <span style="color: #6c71c4;">"relative_path"</span>: <span style="color: #2aa198;">"src/provider.sdm"</span>
      <span style="color: #859900;">}</span>,
      <span style="color: #6c71c4;">"item"</span>: <span style="color: #859900;">{</span>
        <span style="color: #6c71c4;">"relative_uri"</span>: <span style="color: #2aa198;">"v3/provider#"</span>,
        <span style="color: #6c71c4;">"relative_path"</span>: <span style="color: #2aa198;">"src/provider-v3.sdm"</span>
      <span style="color: #859900;">}</span>
    <span style="color: #b58900;">}</span>
  <span style="color: #2aa198;">}</span>
<span style="color: #657b83;">}</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Simon Johnston</p>
<p class="date">Created: 2023-12-21 Thu 10:00</p>
</div>
</body>
</html>
